waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_atim.c
#define IS_FL_ATIM_ETR_PSC(__VALUE__)               (((__VALUE__) == FL_ATIM_ETR_PSC_DIV1) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV2) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV4) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV8))

#define IS_FL_ATIM_ETR_POLARITY(__VALUE__)         (((__VALUE__) == FL_ATIM_ETR_POLARITY_NORMAL) \
                                                     || ((__VALUE__) == FL_ATIM_ETR_POLARITY_INVERT))

#define IS_FL_ATIM_IC_POLARITY(__VALUE__)          (((__VALUE__) == FL_ATIM_IC_POLARITY_NORMAL) \
                                                       || ((__VALUE__) == FL_ATIM_IC_POLARITY_INVERT))

#define IS_FL_ATIM_IC_ACTIVEINPUT(__VALUE__)          (((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_NORMAL) \
                                                       || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER) \
                                                       || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_TRC))

#define IS_FL_ATIM_IC_PRESCALER(__VALUE__)         (((__VALUE__) == FL_ATIM_IC_PSC_DIV1) \
                                                     || ((__VALUE__) == FL_ATIM_IC_PSC_DIV2) \
                                                     || ((__VALUE__) == FL_ATIM_IC_PSC_DIV4) \
                                                     || ((__VALUE__) == FL_ATIM_IC_PSC_DIV8))

#define IS_FL_ATIM_OC_POLARITY(__VALUE__)          (((__VALUE__) == FL_ATIM_OC_POLARITY_NORMAL) \
                                                    || ((__VALUE__) == FL_ATIM_OC_POLARITY_INVERT))

#define IS_FL_ATIM_OC_MODE(__VALUE__)               (((__VALUE__) ==   FL_ATIM_OC_MODE_FROZEN) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_ACTIVE) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_INACTIVE) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_TOGGLE) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_FORCED_INACTIVE) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_FORCED_ACTIVE) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_PWM1) \
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_PWM2)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_RETRIG_OPM1)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_RETRIG_OPM2)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_COMBINED_PWM1)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_COMBINED_PWM2)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_ASSYMETRIC_PWM1)\
                                                      || ((__VALUE__) == FL_ATIM_OC_MODE_ASSYMETRIC_PWM2))\

#define IS_FL_ATIM_AUTORELOAB_STATE(__VALUE__)          (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_FASTMODE(__VALUE__)          (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_PRELOAD(__VALUE__)          (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_ETR_CLEARN(__VALUE__)        (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OCN_STATE(__VALUE__)          (((__VALUE__) == FL_ENABLE)\
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_STATE(__VALUE__)          (((__VALUE__) == FL_ENABLE)\
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_IDLESTATE(__VALUE__)          (((__VALUE__) == FL_ATIM_OC_IDLE_STATE_LOW) \
                                                    || ((__VALUE__) == FL_ATIM_OC_IDLE_STATE_HIGH))

#define IS_FL_ATIM_OC_NIDLESTATE(__VALUE__)        (((__VALUE__) == FL_ATIM_OCN_IDLE_STATE_LOW) \
                                                    || ((__VALUE__) == FL_ATIM_OCN_IDLE_STATE_HIGH))

#define IS_FL_ATIM_OC_NPOLARITY(__VALUE__)        (((__VALUE__) == FL_ATIM_OCN_POLARITY_NORMAL) \
                                                    || ((__VALUE__) == FL_ATIM_OCN_POLARITY_INVERT))

#define IS_FL_ATIM_BDTR_FILTER(__VALUE__)           (((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N2) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N4) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N8) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N12) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N16) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N24) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N32) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N48) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N64) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N80) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N96) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N128) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N160) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N192) \
                                                     || ((__VALUE__) == FL_ATIM_BREAK_FILTER_DIV1_N256))

#define IS_FL_ATIM_BDTR_BREAKSOURCE(__VALUE__)       (((__VALUE__) == FL_ATIM_BKIN_SOURCE_GPIO1) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_GPIO2) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_COMP1) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_COMP2) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_COMP3) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_HFDET) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_SVD) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_LOCKUP) \
                                                     || ((__VALUE__) == FL_ATIM_BKIN_SOURCE_RAMPARITY))

#define IS_FL_ATIM_OSSR_STATE(__VALUE__) (((__VALUE__) == FL_ATIM_OSSR_DISABLE) \
                                     || ((__VALUE__) == FL_ATIM_OSSR_ENABLE))

